#!/usr/bin/env python3
# _*_ coding:utf-8 _*_
'''
 ____       _     _     _ _   __  __           _
|  _ \ __ _| |__ | |__ (_) |_|  \/  | __ _ ___| | __
| |_) / _` | '_ \| '_ \| | __| |\/| |/ _` / __| |/ /
|  _ < (_| | |_) | |_) | | |_| |  | | (_| \__ \   <
|_| \_\__,_|_.__/|_.__/|_|\__|_|  |_|\__,_|___/_|\_\
'''

#如您所见，这是一个需要注册CEBSYS才能使用的功能
#每个账号每个月可使用250次，请根据自身情况调度该功能
#您需要更改的内容为API_ID和API_SECRET

API_URL = "https://censys.io/api/v1/search/ipv4"
API_ID = "API_ID"
API_SECRET = "API_SECRET"